from openpyxl import Workbook
# 每4项拆分为一个等级
cut = 4
# 总共拆成3个等级
nums = 3

# 取出在汇总排序功能中最后得到的total_rows的一小部分数据
total_rows = [['陈洁', '销售七组', 10393, 815, 2993, 971, 1833, 889, 1128, 8629, 1], ['刘波', '销售七组', 10133, 1496, 2667, 774, 1924, 315, 1142, 8318, 2], ['陈涛', '销售六组', 10140, 1481, 2267, 568, 1989, 1236, 741, 8282, 3], ['张华', '销售二组', 10212, 1395, 2908, 490, 1485, 1149, 837, 8264, 4], ['陈伟', 
'销售八组', 10427, 1289, 2828, 502, 1279, 1354, 972, 8224, 5], ['李冬梅', '销售六组', 10195, 326, 2946, 886, 1963, 1309, 657, 8087, 6], ['杨秀兰', '销售五组', 10371, 509, 2715, 992, 1394, 1301, 1174, 8085, 7], ['杨林', '销售四组', 10063, 862, 2766, 799, 1611, 964, 1077, 8079, 8], ['李波', '销售一组', 10044, 1380, 2995, 886, 946, 1468, 327, 8002, 9], ['李雪梅', '销售二组', 10078, 1099, 2448, 760, 1574, 1215, 889, 7985, 10]]

# 按等级数量，拆分等级表
for num in range(nums):
    # 新建工作表
    new_wb = Workbook()
    new_sheet = new_wb.active

    # 写入表头
    new_sheet.append(['姓名', '销售小组', '工号', '牛奶/瓶', '矿泉水/瓶', '果蔬汁/瓶', '汽水/瓶', '茶饮料/瓶', '咖啡/瓶', '总计/瓶', '销售排名'])

    # 写入数据
    for row in total_rows[num*4:(num+1)*4 ]:
        new_sheet.append(row)
    # 保存等级表
    new_wb.save('等级{}销售表.xlsx'.format(num + 1))